GopalSaraf/Practicals/PSDL/include/proc/pic16f17115.inc
// Register: IOCAF
#define IOCAF IOCAF
IOCAF                                    equ 01E93h
// bitfield definitions
IOCAF_IOCAF0_POSN                        equ 0000h
IOCAF_IOCAF0_POSITION                    equ 0000h
IOCAF_IOCAF0_SIZE                        equ 0001h
IOCAF_IOCAF0_LENGTH                      equ 0001h
IOCAF_IOCAF0_MASK                        equ 0001h
IOCAF_IOCAF1_POSN                        equ 0001h
IOCAF_IOCAF1_POSITION                    equ 0001h
IOCAF_IOCAF1_SIZE                        equ 0001h
IOCAF_IOCAF1_LENGTH                      equ 0001h
IOCAF_IOCAF1_MASK                        equ 0002h
IOCAF_IOCAF2_POSN                        equ 0002h
IOCAF_IOCAF2_POSITION                    equ 0002h
IOCAF_IOCAF2_SIZE                        equ 0001h
IOCAF_IOCAF2_LENGTH                      equ 0001h
IOCAF_IOCAF2_MASK                        equ 0004h
IOCAF_IOCAF3_POSN                        equ 0003h
IOCAF_IOCAF3_POSITION                    equ 0003h
IOCAF_IOCAF3_SIZE                        equ 0001h
IOCAF_IOCAF3_LENGTH                      equ 0001h
IOCAF_IOCAF3_MASK                        equ 0008h
IOCAF_IOCAF4_POSN                        equ 0004h
IOCAF_IOCAF4_POSITION                    equ 0004h
IOCAF_IOCAF4_SIZE                        equ 0001h
IOCAF_IOCAF4_LENGTH                      equ 0001h
IOCAF_IOCAF4_MASK                        equ 0010h
IOCAF_IOCAF5_POSN                        equ 0005h
IOCAF_IOCAF5_POSITION                    equ 0005h
IOCAF_IOCAF5_SIZE                        equ 0001h
IOCAF_IOCAF5_LENGTH                      equ 0001h
IOCAF_IOCAF5_MASK                        equ 0020h

// Register: RA1I2C
#define RA1I2C RA1I2C
RA1I2C                                   equ 01EE1h
// bitfield definitions
RA1I2C_TH_POSN                           equ 0000h
RA1I2C_TH_POSITION                       equ 0000h
RA1I2C_TH_SIZE                           equ 0002h
RA1I2C_TH_LENGTH                         equ 0002h
RA1I2C_TH_MASK                           equ 0003h
RA1I2C_PU_POSN                           equ 0004h
RA1I2C_PU_POSITION                       equ 0004h
RA1I2C_PU_SIZE                           equ 0002h
RA1I2C_PU_LENGTH                         equ 0002h
RA1I2C_PU_MASK                           equ 0030h
RA1I2C_SLEW_POSN                         equ 0006h
RA1I2C_SLEW_POSITION                     equ 0006h
RA1I2C_SLEW_SIZE                         equ 0002h
RA1I2C_SLEW_LENGTH                       equ 0002h
RA1I2C_SLEW_MASK                         equ 00C0h
RA1I2C_TH0_POSN                          equ 0000h
RA1I2C_TH0_POSITION                      equ 0000h
RA1I2C_TH0_SIZE                          equ 0001h
RA1I2C_TH0_LENGTH                        equ 0001h
RA1I2C_TH0_MASK                          equ 0001h
RA1I2C_TH1_POSN                          equ 0001h
RA1I2C_TH1_POSITION                      equ 0001h
RA1I2C_TH1_SIZE                          equ 0001h
RA1I2C_TH1_LENGTH                        equ 0001h
RA1I2C_TH1_MASK                          equ 0002h
RA1I2C_PU0_POSN                          equ 0004h
RA1I2C_PU0_POSITION                      equ 0004h
RA1I2C_PU0_SIZE                          equ 0001h
RA1I2C_PU0_LENGTH                        equ 0001h
RA1I2C_PU0_MASK                          equ 0010h
RA1I2C_PU1_POSN                          equ 0005h
RA1I2C_PU1_POSITION                      equ 0005h
RA1I2C_PU1_SIZE                          equ 0001h
RA1I2C_PU1_LENGTH                        equ 0001h
RA1I2C_PU1_MASK                          equ 0020h
RA1I2C_SLEW0_POSN                        equ 0006h
RA1I2C_SLEW0_POSITION                    equ 0006h
RA1I2C_SLEW0_SIZE                        equ 0001h
RA1I2C_SLEW0_LENGTH                      equ 0001h
RA1I2C_SLEW0_MASK                        equ 0040h
RA1I2C_SLEW1_POSN                        equ 0007h
RA1I2C_SLEW1_POSITION                    equ 0007h
RA1I2C_SLEW1_SIZE                        equ 0001h
RA1I2C_SLEW1_LENGTH                      equ 0001h
RA1I2C_SLEW1_MASK                        equ 0080h

// Register: RA2I2C
#define RA2I2C RA2I2C
RA2I2C                                   equ 01EE2h
// bitfield definitions
RA2I2C_TH_POSN                           equ 0000h
RA2I2C_TH_POSITION                       equ 0000h
RA2I2C_TH_SIZE                           equ 0002h
RA2I2C_TH_LENGTH                         equ 0002h
RA2I2C_TH_MASK                           equ 0003h
RA2I2C_PU_POSN                           equ 0004h
RA2I2C_PU_POSITION                       equ 0004h
RA2I2C_PU_SIZE                           equ 0002h
RA2I2C_PU_LENGTH                         equ 0002h
RA2I2C_PU_MASK                           equ 0030h
RA2I2C_SLEW_POSN                         equ 0006h
RA2I2C_SLEW_POSITION                     equ 0006h
RA2I2C_SLEW_SIZE                         equ 0002h
RA2I2C_SLEW_LENGTH                       equ 0002h
RA2I2C_SLEW_MASK                         equ 00C0h
RA2I2C_TH0_POSN                          equ 0000h
RA2I2C_TH0_POSITION                      equ 0000h
RA2I2C_TH0_SIZE                          equ 0001h
RA2I2C_TH0_LENGTH                        equ 0001h
RA2I2C_TH0_MASK                          equ 0001h
RA2I2C_TH1_POSN                          equ 0001h
RA2I2C_TH1_POSITION                      equ 0001h
RA2I2C_TH1_SIZE                          equ 0001h
RA2I2C_TH1_LENGTH                        equ 0001h
RA2I2C_TH1_MASK                          equ 0002h
RA2I2C_PU0_POSN                          equ 0004h
RA2I2C_PU0_POSITION                      equ 0004h
RA2I2C_PU0_SIZE                          equ 0001h
RA2I2C_PU0_LENGTH                        equ 0001h
RA2I2C_PU0_MASK                          equ 0010h
RA2I2C_PU1_POSN                          equ 0005h
RA2I2C_PU1_POSITION                      equ 0005h
RA2I2C_PU1_SIZE                          equ 0001h
RA2I2C_PU1_LENGTH                        equ 0001h
RA2I2C_PU1_MASK                          equ 0020h
RA2I2C_SLEW0_POSN                        equ 0006h
RA2I2C_SLEW0_POSITION                    equ 0006h
RA2I2C_SLEW0_SIZE                        equ 0001h
RA2I2C_SLEW0_LENGTH                      equ 0001h
RA2I2C_SLEW0_MASK                        equ 0040h
RA2I2C_SLEW1_POSN                        equ 0007h
RA2I2C_SLEW1_POSITION                    equ 0007h
RA2I2C_SLEW1_SIZE                        equ 0001h
RA2I2C_SLEW1_LENGTH                      equ 0001h
RA2I2C_SLEW1_MASK                        equ 0080h

